package lesson_03;

public class Task5 {
    public static void main(String[] args) {
//        int uberflu? = 0;              // найменування змінної uberflu? порушено при використанням недоступного символу <?>
//        int _Identifier = 0;          // найменування змінної _Identifier відповідає стандарту написання camelCase i не використовує ключових слів або недоступних символів
//        int \u006fIdentifier = 0;    // найменування змінної \u006fIdentifier порушено при використанням недоступного символу <\>
//        int &myVar = 0;             // найменування змінної &myVar порушено при використанням недоступного символу <&>
//        int myVariab1le = 0;       // найменування змінної myVariab1le відповідає стандарту написання camelCase i не використовує ключових слів або недоступних символів
    }
}
