USE MyDBTask2;

DROP TABLE accounting;

SELECT * FROM MyDBTask2.accounting;


CREATE TABLE accounting(

id INT AUTO_INCREMENT NOT NULL,                              -- інкрементарний ід
-- ---------------------------------------------------
-- HR
Відповідальни_HR VARCHAR(20),								 -- ПІБ фахівця HR
-- ---------------------------------------------------
-- Працівник
Дата_прийняття_на_Роботу VARCHAR(10),  					     -- дата коли було прийнято фахівця на роботу
Прізвище_працівника VARCHAR(20),							 -- Прізвище
Імя_працівника VARCHAR(20),									 -- Імя
По_батькові_працівника VARCHAR(20),							 -- Побатькові
Посада VARCHAR(30),                   					     -- Посада яку займає працівник
Стать VARCHAR(1),											 -- Стать працівника
Дата_народження VARCHAR(10),								 -- Дата народження рацівника
Наявність_дітей BOOLEAN,								 -- наявність дітей
Кількість_дітей_до_10_років INT NOT NULL,					 -- Кількість дітей
Номер_телефону VARCHAR(20),									 -- Номер телефону працівника

-- ---------------------------------------------------
-- Додаток
Безпосередній_керівник VARCHAR(20),							 -- ПІБ Керівника 
Департамент VARCHAR(20), 									 -- Структурний підрозділ куди прийнято працівника
ЗП_до_вирахування_податку DOUBLE NOT NULL,       				 -- Сумма заробітної плати
Необхідність_у_додаткових_днях_відпустки BOOLEAN,			 -- Додаткових 7 днів відпустки згідно КЗпП України
Дата_звільнення_з_роботи VARCHAR(10),  						 -- дата коли було звільнено фахівця з роботи
PRIMARY KEY(id)

);

INSERT INTO accounting
(Відповідальни_HR,   Дата_прийняття_на_Роботу, Прізвище_працівника, Імя_працівника, По_батькові_працівника, Посада, Стать, Дата_народження, Наявність_дітей, Кількість_дітей_до_10_років, Номер_телефону, Безпосередній_керівник, Департамент, ЗП_до_вирахування_податку, Необхідність_у_додаткових_днях_відпустки, Дата_звільнення_з_роботи)
VALUES
('Іванова Світлана',  '01/01/2022',  'Сердюков', 'Дмитро', 'Борисович',  'Інженер',  'Ч',  '12/03/1990', false, 0, '380976664422', 'Федотов В.С.', 'Технічний',               12348.00,    false, '00/00/0000');

INSERT INTO accounting
(Відповідальни_HR,   Дата_прийняття_на_Роботу, Прізвище_працівника, Імя_працівника, По_батькові_працівника, Посада, Стать, Дата_народження, Наявність_дітей, Кількість_дітей_до_10_років, Номер_телефону, Безпосередній_керівник, Департамент, ЗП_до_вирахування_податку, Необхідність_у_додаткових_днях_відпустки, Дата_звільнення_з_роботи)
VALUES
('Іванова Світлана',  '10/02/2021',  'Колочко',  'Юлія',   'Андріївна',  'Бухгалтер','Ж',  '05/12/1980', true,  1, '380667778899', 'Жвачка Т.Г.',  'Бухгалтерського обліку',  7854.20,     true, '00/00/0000');

INSERT INTO accounting
(Відповідальни_HR,   Дата_прийняття_на_Роботу, Прізвище_працівника, Імя_працівника, По_батькові_працівника, Посада, Стать, Дата_народження, Наявність_дітей, Кількість_дітей_до_10_років, Номер_телефону, Безпосередній_керівник, Департамент, ЗП_до_вирахування_податку, Необхідність_у_додаткових_днях_відпустки, Дата_звільнення_з_роботи)
VALUES
('Герцен Наталія',    '12/07/2016',  'Крючков',  'Ігор',   'Вадимович',  'Водій',    'Ч',  '12/03/1975', true,  2, '380113366777', 'Федотов В.С.', 'Технічний',               9713.00,     false, '00/00/0000');

INSERT INTO accounting
(Відповідальни_HR,   Дата_прийняття_на_Роботу, Прізвище_працівника, Імя_працівника, По_батькові_працівника, Посада, Стать, Дата_народження, Наявність_дітей, Кількість_дітей_до_10_років, Номер_телефону, Безпосередній_керівник, Департамент, ЗП_до_вирахування_податку, Необхідність_у_додаткових_днях_відпустки, Дата_звільнення_з_роботи)
VALUES
('Короткий Сергій',   '31/12/2001',  'Чигир',    'Олег',   'Юрійович',   'Директор',  'Ч', '17/07/1963', true,  2, '3800977613',   'Струм Ю.В.',   'Внутрійньої безпеки',     67999.00,    true,  '12/09/2022');