package lesson_05;

public class LogicOperations {
    public static void main(String[] args) {


        int x = 5;
        int y = 10;
        int z = 15;


        x += y >> x++ * z;
//        5++ == 5
//        z == 15
//        5 * 15 == 75
//        y >> 10 - зсуваємо біти в право та заповнюємо нулями
//        Побитовий  зсув на 10 >> числа 75
//        0011 1101|
//        1111 1111| (11 0011 1101) -> видаляється
//        x = x + 0 == x = 5 + 0 = 5
//        Результат операції == 5
        System.out.println(x);


        z = ++x & y * 5;
//        ++x == 6
//        y * 5 == (10 * 5) == 50
//        Побітова кон'юнкція 6 та 50
//        6 == 0000 0110
//       50 == 0011 0010
//            ------------
//       2 ==  0000 0010
        System.out.println(z);


        y /= x + 5 | z;
//        x == 5
//        x == 5 + 5 == 10
//        Побітова диз'юнкція 5 та 10
//        5 == 0000 0101
//       10 == 0000 1000
//            ------------
//       15 == 0000 1101

//        y == 10 /= 15 == 0.66 -> запишиться як 0
        System.out.println(y);


        z = x++ & y * 5;
//        5++ == 5
//        Побітова кон'юнкція 5 та 50
//        y * 5 (10 * 5)  == 50
//        5 == 0000 0101
//       50 == 0011 0010
//            ------------
//       0 ==  0000 0000
        System.out.println(z);


        x = y << x++ ^ z;
//        5++ == 5
//        Побітове виключення XOR
//        z == 15
//        5 == 0000 0101
//       15 == 0000 1101
//            ------------
//       12 == 0000 1010
//        побітовий зсув 10 << 12
//                                                 10 == |0000 1000
//                                                 12 == |0000 1010
//       Зсув в ліво на 12  елементів << 0000 1010 0000  |0000 0000
//                                                  0 == |0000 0000
        System.out.println(x);

    }
}
